{
  "class": "Process Type, either <strong>CommandLineTool</strong> or <strong>Workflow</strong>.",
  "identifier": "The unique identifier for this process object.",
  "label": "A short, human-readable label of this process object.",
  "description": "A long, human-readable description of this process object.",
  "arguments": "Command line bindings which are not directly associated with input parameters.",
  "baseCommand": "Specifies the program to execute. If an array, the first element of the array is the command to execute, and subsequent elements are mandatory command line arguments. The elements in baseCommand must appear before any command line bindings from inputBinding or arguments.",
  "inputs": "Defines the input parameters of the process. The process is ready to run when all required input parameters are associated with concrete values.",
  "outputs": "Defines the parameters representing the output of the process.",
  "requirements": "Declares requirements that apply to either the runtime environment or the workflow engine that must be met in order to execute this process.",
  "steps": "The individual steps that make up the workflow. Each step is executed when all of its input data links are fulfilled.",
  "paramIdentifier": "The unique identifier for this parameter object.",
  "paramType": "Specify valid types of data that may be assigned to this parameter.",
  "paramDefault": "The default value to use for this parameter if the parameter is missing from the input object, or if the value of the parameter in the input object is null.",
  "paramStreamable": "A value of true indicates that the file is read or written sequentially without seeking.",
  "paramInputBinding": "Describes how to handle the inputs of a process and convert them into a concrete form for execution, such as command line parameters.",
  "paramFormat": "This is the file format that will be assigned to the output parameter.",
  "paramOutputBinding": "Describes how to handle the outputs of a process.",
  "paramOutputSource": "Specifies one or more workflow parameters that supply the value of to the output parameter.",
  "paramScatter": "A \"scatter\" operation specifies that the associated workflow step or subworkflow should execute separately over a list of input elements. Each job making up a scatter operation is independent and may be executed concurrently. The scatter field specifies one or more input parameters which will be scattered.",
  "paramScatterMethod": "Describes which method to used to decompose the input into a discrete set of jobs.",
  "paramRun": "Specifies the process to run.",
  "cwlVersion": "Common Workflow Language specification version.",
  "authors": "The main authors of the Application Package.",
  "codeRepository": "Link to the repository where the Application code is located (e.g. SVN, github).",
  "contributors": "Secondary contributors to the Application Package.",
  "dateCreated": "The date on which the Application Package was created.",
  "keywords": "Keywords used to describe this application. Multiple entries in a keywords list are delimited by commas.",
  "license": "An URL to the license document that applies to this application.",
  "releaseNotes": "Description of what changed in this version.",
  "softwareVersion": "The version of the Application Package.",
  "logo": "Logo of the Application Package.",
  "schemas": "Schemas used in the Application Package.",
  "namespaces": "Namespaces definitions."
}
